Revit 2026 API

# ExportFontInfo(ExportFontInfo) Constructor

---

Constructs a new copy of the input ExportFontInfo object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExportFontInfo(
	ExportFontInfo other
)
```
```vb
Public Sub New (
	other As ExportFontInfo
)
```
```cpp
public:
ExportFontInfo(
	ExportFontInfo^ other
)
```
```fsharp
new :
        other : ExportFontInfo -> ExportFontInfo
```

#### Parameters

other ExportFontInfo

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportFontInfo Class

ExportFontInfo Overload

Autodesk.Revit.DB Namespace